const spaceFacts = [
    "Слънцето съдържа 99.8% от общата маса на цялата слънчева система.",
    "Меркурий е най-малката планета в слънчевата система.",
    "Венера е най-горещата планета в слънчевата система.",
    "Земята е единствената планета в Слънчевата система, за която се знае, че поддържа живот.",
    "Марс има най-големия вулкан и каньон в слънчевата система.",
    "Юпитер има най-кратък ден от всички планети, завършвайки едно завъртане за около 10 часа.",
    "Сатурн е най-малко гъстата планета в слънчевата система. Нейната плътност е по-малка от тази на водата.",
    "Най-големият месечен спътник на Нептун, Тритон, обикаля планетата в обратна посока на въртенето на Нептун.",
    "Сатурн има най-голям брой планетарни пръстени в Слънчевата система.",
    "Юпитер е най-голямата планета в слънчевата система.",
    "На Юпитер има атмосферни явления, като Голямото Червено Петно, което е най-големият вихър в слънчевата система.",
    "Плутон беше класифициран като планета, а после като джудже на карликова планета.",
    "Аполо 11 беше първият мисионен полет, който изпрати човек на Луната през 1969 година.",
    "Халеевата комета, която се вижда веднъж на 76 години, беше първооткрита през 1986 година.",
    "Астероидите са малки космически тела, които обикновено обикалят около Слънцето. Най-големият астероид в нашата слънчева система е Церера.",
    "Най-дълбокият каньон в слънчевата система се намира на Марс и се казва Вал Маринъ"
];

function displayRandomFact() {
    const randomIndex = Math.floor(Math.random() * spaceFacts.length);
    const randomFact = spaceFacts[randomIndex];

    document.getElementById("factDisplay").textContent = randomFact;

    const factPopup = document.getElementById("factPopup");
    factPopup.classList.add("show");
}

document.getElementById('factButton').addEventListener('click', displayRandomFact);

document.getElementById('closePopup').addEventListener('click', () => {
    document.getElementById('factPopup').classList.remove("show");
});
